###############################################################################
# Created by write_sdc
# Wed Jul 10 02:29:35 2024
###############################################################################
current_design D2DAdapter
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 10.0000 
set_clock_uncertainty 0.2500 clk
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {clock}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpClkAck}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpConfig_bits[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpConfig_bits[10]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpConfig_bits[11]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpConfig_bits[12]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpConfig_bits[13]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpConfig_bits[14]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpConfig_bits[15]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpConfig_bits[16]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpConfig_bits[17]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpConfig_bits[18]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpConfig_bits[19]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpConfig_bits[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpConfig_bits[20]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpConfig_bits[21]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpConfig_bits[22]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpConfig_bits[23]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpConfig_bits[24]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpConfig_bits[25]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpConfig_bits[26]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpConfig_bits[27]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpConfig_bits[28]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpConfig_bits[29]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpConfig_bits[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpConfig_bits[30]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpConfig_bits[31]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpConfig_bits[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpConfig_bits[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpConfig_bits[5]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpConfig_bits[6]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpConfig_bits[7]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpConfig_bits[8]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpConfig_bits[9]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpConfig_valid}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpCorruptCrc}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpData_bits[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpData_bits[10]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpData_bits[11]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpData_bits[12]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpData_bits[13]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpData_bits[14]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpData_bits[15]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpData_bits[16]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpData_bits[17]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpData_bits[18]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpData_bits[19]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpData_bits[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpData_bits[20]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpData_bits[21]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpData_bits[22]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpData_bits[23]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpData_bits[24]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpData_bits[25]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpData_bits[26]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpData_bits[27]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpData_bits[28]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpData_bits[29]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpData_bits[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpData_bits[30]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpData_bits[31]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpData_bits[32]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpData_bits[33]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpData_bits[34]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpData_bits[35]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpData_bits[36]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpData_bits[37]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpData_bits[38]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpData_bits[39]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpData_bits[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpData_bits[40]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpData_bits[41]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpData_bits[42]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpData_bits[43]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpData_bits[44]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpData_bits[45]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpData_bits[46]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpData_bits[47]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpData_bits[48]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpData_bits[49]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpData_bits[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpData_bits[50]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpData_bits[51]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpData_bits[52]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpData_bits[53]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpData_bits[54]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpData_bits[55]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpData_bits[56]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpData_bits[57]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpData_bits[58]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpData_bits[59]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpData_bits[5]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpData_bits[60]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpData_bits[61]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpData_bits[62]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpData_bits[63]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpData_bits[6]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpData_bits[7]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpData_bits[8]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpData_bits[9]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpData_irdy}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpData_valid}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpDllpOfc}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpDllp_bits[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpDllp_bits[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpDllp_bits[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpDllp_bits[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpDllp_bits[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpDllp_bits[5]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpDllp_bits[6]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpDllp_bits[7]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpDllp_valid}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpLinkError}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpRetimerCrd}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpRxActiveStatus}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpStallAck}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpStateReq[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpStateReq[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpStateReq[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpStateReq[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpStream_protoStack}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpStream_protoType[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpStream_protoType[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpStream_protoType[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpWakeReq}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plConfigCredit}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpConfigCredit}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpData_ready}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plClkReq}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plConfig_bits[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plConfig_bits[10]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plConfig_bits[11]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plConfig_bits[12]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plConfig_bits[13]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plConfig_bits[14]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plConfig_bits[15]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plConfig_bits[16]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plConfig_bits[17]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plConfig_bits[18]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plConfig_bits[19]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plConfig_bits[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plConfig_bits[20]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plConfig_bits[21]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plConfig_bits[22]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plConfig_bits[23]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plConfig_bits[24]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plConfig_bits[25]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plConfig_bits[26]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plConfig_bits[27]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plConfig_bits[28]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plConfig_bits[29]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plConfig_bits[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plConfig_bits[30]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plConfig_bits[31]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plConfig_bits[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plConfig_bits[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plConfig_bits[5]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plConfig_bits[6]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plConfig_bits[7]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plConfig_bits[8]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plConfig_bits[9]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plConfig_valid}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plCorrectableError}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plData_bits[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plData_bits[10]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plData_bits[11]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plData_bits[12]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plData_bits[13]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plData_bits[14]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plData_bits[15]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plData_bits[16]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plData_bits[17]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plData_bits[18]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plData_bits[19]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plData_bits[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plData_bits[20]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plData_bits[21]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plData_bits[22]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plData_bits[23]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plData_bits[24]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plData_bits[25]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plData_bits[26]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plData_bits[27]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plData_bits[28]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plData_bits[29]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plData_bits[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plData_bits[30]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plData_bits[31]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plData_bits[32]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plData_bits[33]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plData_bits[34]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plData_bits[35]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plData_bits[36]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plData_bits[37]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plData_bits[38]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plData_bits[39]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plData_bits[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plData_bits[40]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plData_bits[41]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plData_bits[42]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plData_bits[43]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plData_bits[44]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plData_bits[45]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plData_bits[46]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plData_bits[47]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plData_bits[48]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plData_bits[49]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plData_bits[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plData_bits[50]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plData_bits[51]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plData_bits[52]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plData_bits[53]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plData_bits[54]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plData_bits[55]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plData_bits[56]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plData_bits[57]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plData_bits[58]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plData_bits[59]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plData_bits[5]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plData_bits[60]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plData_bits[61]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plData_bits[62]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plData_bits[63]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plData_bits[6]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plData_bits[7]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plData_bits[8]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plData_bits[9]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plData_valid}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plError}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plInbandPres}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plLinkWidth[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plLinkWidth[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plLinkWidth[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plNonFatalError}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plPhyInRecenter}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plRetimerCrd}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plSpeedMode[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plSpeedMode[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plSpeedMode[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plStallReq}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plStateStatus[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plStateStatus[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plStateStatus[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plStateStatus[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plTrainError}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plWakeAck}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reset}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpConfigCredit}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_lpData_ready}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plCerror}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plClkReq}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plConfig_bits[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plConfig_bits[10]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plConfig_bits[11]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plConfig_bits[12]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plConfig_bits[13]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plConfig_bits[14]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plConfig_bits[15]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plConfig_bits[16]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plConfig_bits[17]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plConfig_bits[18]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plConfig_bits[19]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plConfig_bits[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plConfig_bits[20]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plConfig_bits[21]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plConfig_bits[22]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plConfig_bits[23]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plConfig_bits[24]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plConfig_bits[25]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plConfig_bits[26]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plConfig_bits[27]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plConfig_bits[28]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plConfig_bits[29]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plConfig_bits[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plConfig_bits[30]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plConfig_bits[31]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plConfig_bits[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plConfig_bits[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plConfig_bits[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plConfig_bits[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plConfig_bits[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plConfig_bits[8]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plConfig_bits[9]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plConfig_valid}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plData_bits[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plData_bits[10]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plData_bits[11]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plData_bits[12]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plData_bits[13]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plData_bits[14]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plData_bits[15]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plData_bits[16]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plData_bits[17]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plData_bits[18]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plData_bits[19]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plData_bits[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plData_bits[20]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plData_bits[21]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plData_bits[22]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plData_bits[23]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plData_bits[24]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plData_bits[25]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plData_bits[26]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plData_bits[27]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plData_bits[28]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plData_bits[29]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plData_bits[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plData_bits[30]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plData_bits[31]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plData_bits[32]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plData_bits[33]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plData_bits[34]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plData_bits[35]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plData_bits[36]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plData_bits[37]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plData_bits[38]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plData_bits[39]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plData_bits[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plData_bits[40]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plData_bits[41]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plData_bits[42]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plData_bits[43]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plData_bits[44]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plData_bits[45]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plData_bits[46]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plData_bits[47]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plData_bits[48]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plData_bits[49]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plData_bits[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plData_bits[50]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plData_bits[51]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plData_bits[52]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plData_bits[53]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plData_bits[54]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plData_bits[55]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plData_bits[56]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plData_bits[57]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plData_bits[58]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plData_bits[59]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plData_bits[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plData_bits[60]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plData_bits[61]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plData_bits[62]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plData_bits[63]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plData_bits[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plData_bits[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plData_bits[8]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plData_bits[9]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plData_valid}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plDllpOfc}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plDllp_bits[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plDllp_bits[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plDllp_bits[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plDllp_bits[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plDllp_bits[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plDllp_bits[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plDllp_bits[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plDllp_bits[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plDllp_valid}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plError}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plFlitCancel}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plInbandPres}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plLinkWidth[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plLinkWidth[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plLinkWidth[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plNfError}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plPhyInL1}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plPhyInL2}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plPhyInRecenter}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plProtocolFlitFormat[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plProtocolFlitFormat[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plProtocolFlitFormat[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plProtocolValid}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plProtocol[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plProtocol[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plProtocol[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plRetimerCrd}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plRxActiveReq}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plSpeedMode[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plSpeedMode[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plSpeedMode[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plStallReq}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plStateStatus[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plStateStatus[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plStateStatus[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plStateStatus[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plStream_protoStack}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plStream_protoType[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plStream_protoType[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plStream_protoType[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plTrainError}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_fdi_plWakeAck}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpClkAck}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpConfig_bits[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpConfig_bits[10]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpConfig_bits[11]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpConfig_bits[12]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpConfig_bits[13]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpConfig_bits[14]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpConfig_bits[15]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpConfig_bits[16]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpConfig_bits[17]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpConfig_bits[18]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpConfig_bits[19]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpConfig_bits[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpConfig_bits[20]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpConfig_bits[21]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpConfig_bits[22]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpConfig_bits[23]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpConfig_bits[24]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpConfig_bits[25]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpConfig_bits[26]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpConfig_bits[27]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpConfig_bits[28]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpConfig_bits[29]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpConfig_bits[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpConfig_bits[30]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpConfig_bits[31]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpConfig_bits[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpConfig_bits[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpConfig_bits[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpConfig_bits[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpConfig_bits[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpConfig_bits[8]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpConfig_bits[9]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpConfig_valid}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpData_bits[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpData_bits[10]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpData_bits[11]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpData_bits[12]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpData_bits[13]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpData_bits[14]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpData_bits[15]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpData_bits[16]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpData_bits[17]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpData_bits[18]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpData_bits[19]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpData_bits[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpData_bits[20]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpData_bits[21]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpData_bits[22]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpData_bits[23]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpData_bits[24]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpData_bits[25]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpData_bits[26]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpData_bits[27]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpData_bits[28]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpData_bits[29]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpData_bits[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpData_bits[30]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpData_bits[31]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpData_bits[32]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpData_bits[33]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpData_bits[34]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpData_bits[35]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpData_bits[36]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpData_bits[37]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpData_bits[38]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpData_bits[39]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpData_bits[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpData_bits[40]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpData_bits[41]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpData_bits[42]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpData_bits[43]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpData_bits[44]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpData_bits[45]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpData_bits[46]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpData_bits[47]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpData_bits[48]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpData_bits[49]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpData_bits[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpData_bits[50]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpData_bits[51]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpData_bits[52]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpData_bits[53]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpData_bits[54]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpData_bits[55]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpData_bits[56]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpData_bits[57]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpData_bits[58]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpData_bits[59]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpData_bits[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpData_bits[60]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpData_bits[61]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpData_bits[62]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpData_bits[63]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpData_bits[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpData_bits[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpData_bits[8]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpData_bits[9]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpData_irdy}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpData_valid}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpLinkError}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpRetimerCrd}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpStallAck}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpStateReq[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpStateReq[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpStateReq[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpStateReq[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_lpWakeReq}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_rdi_plConfigCredit}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {io_fdi_lpConfigCredit}]
set_load -pin_load 0.0334 [get_ports {io_fdi_lpData_ready}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plCerror}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plClkReq}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plConfig_valid}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plData_valid}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plDllpOfc}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plDllp_valid}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plError}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plFlitCancel}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plInbandPres}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plNfError}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plPhyInL1}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plPhyInL2}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plPhyInRecenter}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plProtocolValid}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plRetimerCrd}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plRxActiveReq}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plStallReq}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plStream_protoStack}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plTrainError}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plWakeAck}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpClkAck}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpConfig_valid}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpData_irdy}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpData_valid}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpLinkError}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpRetimerCrd}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpStallAck}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpWakeReq}]
set_load -pin_load 0.0334 [get_ports {io_rdi_plConfigCredit}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plConfig_bits[31]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plConfig_bits[30]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plConfig_bits[29]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plConfig_bits[28]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plConfig_bits[27]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plConfig_bits[26]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plConfig_bits[25]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plConfig_bits[24]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plConfig_bits[23]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plConfig_bits[22]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plConfig_bits[21]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plConfig_bits[20]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plConfig_bits[19]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plConfig_bits[18]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plConfig_bits[17]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plConfig_bits[16]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plConfig_bits[15]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plConfig_bits[14]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plConfig_bits[13]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plConfig_bits[12]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plConfig_bits[11]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plConfig_bits[10]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plConfig_bits[9]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plConfig_bits[8]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plConfig_bits[7]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plConfig_bits[6]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plConfig_bits[5]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plConfig_bits[4]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plConfig_bits[3]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plConfig_bits[2]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plConfig_bits[1]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plConfig_bits[0]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plData_bits[63]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plData_bits[62]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plData_bits[61]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plData_bits[60]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plData_bits[59]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plData_bits[58]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plData_bits[57]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plData_bits[56]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plData_bits[55]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plData_bits[54]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plData_bits[53]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plData_bits[52]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plData_bits[51]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plData_bits[50]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plData_bits[49]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plData_bits[48]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plData_bits[47]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plData_bits[46]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plData_bits[45]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plData_bits[44]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plData_bits[43]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plData_bits[42]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plData_bits[41]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plData_bits[40]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plData_bits[39]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plData_bits[38]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plData_bits[37]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plData_bits[36]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plData_bits[35]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plData_bits[34]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plData_bits[33]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plData_bits[32]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plData_bits[31]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plData_bits[30]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plData_bits[29]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plData_bits[28]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plData_bits[27]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plData_bits[26]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plData_bits[25]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plData_bits[24]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plData_bits[23]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plData_bits[22]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plData_bits[21]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plData_bits[20]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plData_bits[19]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plData_bits[18]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plData_bits[17]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plData_bits[16]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plData_bits[15]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plData_bits[14]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plData_bits[13]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plData_bits[12]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plData_bits[11]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plData_bits[10]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plData_bits[9]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plData_bits[8]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plData_bits[7]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plData_bits[6]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plData_bits[5]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plData_bits[4]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plData_bits[3]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plData_bits[2]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plData_bits[1]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plData_bits[0]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plDllp_bits[7]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plDllp_bits[6]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plDllp_bits[5]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plDllp_bits[4]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plDllp_bits[3]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plDllp_bits[2]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plDllp_bits[1]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plDllp_bits[0]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plLinkWidth[2]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plLinkWidth[1]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plLinkWidth[0]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plProtocol[2]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plProtocol[1]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plProtocol[0]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plProtocolFlitFormat[2]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plProtocolFlitFormat[1]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plProtocolFlitFormat[0]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plSpeedMode[2]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plSpeedMode[1]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plSpeedMode[0]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plStateStatus[3]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plStateStatus[2]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plStateStatus[1]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plStateStatus[0]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plStream_protoType[2]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plStream_protoType[1]}]
set_load -pin_load 0.0334 [get_ports {io_fdi_plStream_protoType[0]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpConfig_bits[31]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpConfig_bits[30]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpConfig_bits[29]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpConfig_bits[28]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpConfig_bits[27]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpConfig_bits[26]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpConfig_bits[25]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpConfig_bits[24]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpConfig_bits[23]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpConfig_bits[22]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpConfig_bits[21]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpConfig_bits[20]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpConfig_bits[19]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpConfig_bits[18]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpConfig_bits[17]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpConfig_bits[16]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpConfig_bits[15]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpConfig_bits[14]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpConfig_bits[13]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpConfig_bits[12]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpConfig_bits[11]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpConfig_bits[10]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpConfig_bits[9]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpConfig_bits[8]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpConfig_bits[7]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpConfig_bits[6]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpConfig_bits[5]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpConfig_bits[4]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpConfig_bits[3]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpConfig_bits[2]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpConfig_bits[1]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpConfig_bits[0]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpData_bits[63]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpData_bits[62]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpData_bits[61]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpData_bits[60]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpData_bits[59]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpData_bits[58]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpData_bits[57]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpData_bits[56]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpData_bits[55]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpData_bits[54]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpData_bits[53]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpData_bits[52]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpData_bits[51]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpData_bits[50]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpData_bits[49]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpData_bits[48]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpData_bits[47]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpData_bits[46]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpData_bits[45]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpData_bits[44]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpData_bits[43]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpData_bits[42]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpData_bits[41]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpData_bits[40]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpData_bits[39]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpData_bits[38]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpData_bits[37]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpData_bits[36]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpData_bits[35]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpData_bits[34]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpData_bits[33]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpData_bits[32]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpData_bits[31]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpData_bits[30]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpData_bits[29]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpData_bits[28]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpData_bits[27]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpData_bits[26]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpData_bits[25]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpData_bits[24]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpData_bits[23]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpData_bits[22]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpData_bits[21]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpData_bits[20]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpData_bits[19]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpData_bits[18]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpData_bits[17]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpData_bits[16]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpData_bits[15]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpData_bits[14]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpData_bits[13]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpData_bits[12]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpData_bits[11]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpData_bits[10]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpData_bits[9]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpData_bits[8]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpData_bits[7]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpData_bits[6]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpData_bits[5]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpData_bits[4]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpData_bits[3]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpData_bits[2]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpData_bits[1]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpData_bits[0]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpStateReq[3]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpStateReq[2]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpStateReq[1]}]
set_load -pin_load 0.0334 [get_ports {io_rdi_lpStateReq[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clock}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpClkAck}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpConfig_valid}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpCorruptCrc}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpData_irdy}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpData_valid}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpDllpOfc}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpDllp_valid}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpLinkError}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpRetimerCrd}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpRxActiveStatus}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpStallAck}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpStream_protoStack}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpWakeReq}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_plConfigCredit}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_lpConfigCredit}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_lpData_ready}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plClkReq}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plConfig_valid}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plCorrectableError}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plData_valid}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plError}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plInbandPres}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plNonFatalError}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plPhyInRecenter}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plRetimerCrd}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plStallReq}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plTrainError}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plWakeAck}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reset}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpConfig_bits[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpConfig_bits[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpConfig_bits[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpConfig_bits[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpConfig_bits[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpConfig_bits[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpConfig_bits[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpConfig_bits[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpConfig_bits[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpConfig_bits[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpConfig_bits[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpConfig_bits[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpConfig_bits[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpConfig_bits[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpConfig_bits[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpConfig_bits[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpConfig_bits[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpConfig_bits[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpConfig_bits[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpConfig_bits[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpConfig_bits[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpConfig_bits[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpConfig_bits[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpConfig_bits[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpConfig_bits[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpConfig_bits[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpConfig_bits[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpConfig_bits[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpConfig_bits[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpConfig_bits[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpConfig_bits[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpConfig_bits[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpData_bits[63]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpData_bits[62]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpData_bits[61]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpData_bits[60]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpData_bits[59]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpData_bits[58]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpData_bits[57]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpData_bits[56]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpData_bits[55]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpData_bits[54]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpData_bits[53]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpData_bits[52]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpData_bits[51]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpData_bits[50]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpData_bits[49]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpData_bits[48]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpData_bits[47]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpData_bits[46]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpData_bits[45]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpData_bits[44]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpData_bits[43]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpData_bits[42]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpData_bits[41]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpData_bits[40]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpData_bits[39]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpData_bits[38]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpData_bits[37]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpData_bits[36]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpData_bits[35]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpData_bits[34]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpData_bits[33]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpData_bits[32]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpData_bits[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpData_bits[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpData_bits[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpData_bits[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpData_bits[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpData_bits[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpData_bits[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpData_bits[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpData_bits[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpData_bits[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpData_bits[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpData_bits[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpData_bits[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpData_bits[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpData_bits[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpData_bits[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpData_bits[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpData_bits[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpData_bits[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpData_bits[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpData_bits[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpData_bits[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpData_bits[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpData_bits[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpData_bits[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpData_bits[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpData_bits[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpData_bits[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpData_bits[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpData_bits[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpData_bits[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpData_bits[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpDllp_bits[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpDllp_bits[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpDllp_bits[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpDllp_bits[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpDllp_bits[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpDllp_bits[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpDllp_bits[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpDllp_bits[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpStateReq[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpStateReq[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpStateReq[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpStateReq[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpStream_protoType[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpStream_protoType[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_fdi_lpStream_protoType[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plConfig_bits[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plConfig_bits[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plConfig_bits[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plConfig_bits[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plConfig_bits[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plConfig_bits[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plConfig_bits[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plConfig_bits[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plConfig_bits[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plConfig_bits[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plConfig_bits[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plConfig_bits[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plConfig_bits[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plConfig_bits[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plConfig_bits[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plConfig_bits[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plConfig_bits[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plConfig_bits[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plConfig_bits[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plConfig_bits[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plConfig_bits[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plConfig_bits[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plConfig_bits[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plConfig_bits[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plConfig_bits[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plConfig_bits[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plConfig_bits[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plConfig_bits[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plConfig_bits[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plConfig_bits[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plConfig_bits[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plConfig_bits[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plData_bits[63]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plData_bits[62]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plData_bits[61]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plData_bits[60]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plData_bits[59]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plData_bits[58]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plData_bits[57]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plData_bits[56]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plData_bits[55]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plData_bits[54]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plData_bits[53]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plData_bits[52]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plData_bits[51]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plData_bits[50]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plData_bits[49]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plData_bits[48]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plData_bits[47]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plData_bits[46]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plData_bits[45]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plData_bits[44]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plData_bits[43]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plData_bits[42]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plData_bits[41]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plData_bits[40]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plData_bits[39]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plData_bits[38]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plData_bits[37]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plData_bits[36]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plData_bits[35]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plData_bits[34]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plData_bits[33]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plData_bits[32]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plData_bits[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plData_bits[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plData_bits[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plData_bits[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plData_bits[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plData_bits[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plData_bits[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plData_bits[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plData_bits[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plData_bits[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plData_bits[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plData_bits[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plData_bits[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plData_bits[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plData_bits[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plData_bits[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plData_bits[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plData_bits[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plData_bits[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plData_bits[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plData_bits[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plData_bits[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plData_bits[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plData_bits[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plData_bits[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plData_bits[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plData_bits[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plData_bits[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plData_bits[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plData_bits[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plData_bits[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plData_bits[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plLinkWidth[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plLinkWidth[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plLinkWidth[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plSpeedMode[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plSpeedMode[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plSpeedMode[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plStateStatus[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plStateStatus[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plStateStatus[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_rdi_plStateStatus[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 10.0000 [current_design]
